lvx/base/Documents/бит_му_ЗачетАвансовПоЛизингу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_му_ЗачетАвансовПоЛизингу</Name>
			<Comment>(БИТ МУ)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.бит_Дополнительный_4</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоБюджетам</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_3</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_1</xr:Item>
				<xr:Item>AccumulationRegister.бит_СоответствиеОборотовТрансляции</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоТипамПроводок</xr:Item>
				<xr:Item>AccountingRegister.бит_Бюджетирование</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_5</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_2</xr:Item>
				<xr:Item>InformationRegister.бит_СоответствиеЗаписейТрансляции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма в валюте документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за заполнение данного документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка (служебный реквизит)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтразитьВЗакрытомПериоде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеРаспределения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Comment>Контрагент</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Comment>Договор контрагента</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.бит_ДоговорыКонтрагентов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсАванса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаВзаиморасчетов</Name>
							<Comment>Валюта взаиморасчетов</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КратностьВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаАванса</Name>
							<Comment>Сумма аванса</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютнаяСуммаАванса</Name>
							<Comment>Сумма аванса в валюте взаиморасчетов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОбязательств</Name>
							<Comment>Сумма краткосрочных/долгосрочных обязательств</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютнаяСуммаОбязательств</Name>
							<Comment>Сумма краткосрочных/долгосрочных обязательств в валюте взаиморасчетов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПогашения</Name>
							<Comment>Сумма погашения</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютнаяСуммаПогашения</Name>
							<Comment>Сумма погашения в валюте взаиморасчетов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаАвансов</Name>
							<Comment>Счет учета авансов</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаОбязательств</Name>
							<Comment>Счет учета краткосрочных/долгосрочных обязательств</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПроцентов</Name>
							<Comment>Сумма начисленных процентов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютнаяСуммаПроцентов</Name>
							<Comment>Вал. сумма начисленных процентов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПогашенияПроцентов</Name>
							<Comment>Сумма погашения процентов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютнаяСуммаПогашенияПроцентов</Name>
							<Comment>Сумма погашения процентов  в валюте взаиморасчетов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаПроцентов</Name>
							<Comment>Счет учета процентов</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

lvx/base/Documents/бит_му_ЗачетАвансовПоЛизингу/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте 
Перем мКэшРеквизитовФормы; // Хранит текущие значения реквизитов формы. Клиент.

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(КэшЗначений);
	
	РеквизитКонтрагента = бит_ОбщегоНазначения.ОпределитьИмяРеквизитаКонтрагента();
	
	// Установить видимость реквизитов и заголовков колонок.	
	УправлениеЭлементамиФормы();
	
	Если Параметры.Ключ.Пустая() Тогда  		
		// Заполним валюту МСФО.
		ЗаполнитьВалютуМСФО(); 
		УстановитьСостояниеДокумента();
	Иначе 		
		// Заполним валюту МСФО.
		ЗаполнитьВалютуМСФО(Ложь); 		
	КонецЕсли;
	
	УстановитьУсловноеОформление();

	УстановитьПараметрыВыбораДляСчетов();
	
	// Установка параметров выбора для Договоров.
	бит_РаботаСДиалогамиСервер.УстановитьСвязиПараметровВыбораДоговора(Элементы.ДанныеРаспределенияДоговорКонтрагента, "Объект.ДанныеРаспределения.Контрагент");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	// Зададим имена реквизитов, подлежащих кешированию.
	мКэшРеквизитовФормы = Новый Структура;
	мКэшРеквизитовФормы.Вставить("ВалютаДокумента");
	мКэшРеквизитовФормы.Вставить("КурсДокумента");
	мКэшРеквизитовФормы.Вставить("КратностьДокумента");

	// Запомним текущие значения реквизитов формы.
	ЗаполнитьТекущиеЗначенияРеквизитовФормы();
	
	// Определим список доступных видов договоров.
	ОпределитьСписокДоступныхВидовДоговоров();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры // ПриОткрытии()

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьСостояниеДокумента();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	УстановитьСостояниеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		
	Если ПараметрыЗаписи.РежимЗаписи = ПредопределенноеЗначение("РежимЗаписиДокумента.Проведение") Тогда
		КлючеваяОперация = "Проведениебит_му_ЗачетАвансовПоЛизингу";
		ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ИзменениеВалютыКлиент();
	
КонецПроцедуры // ДатаПриИзменении()

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ВалютаДокументаЗаполнена = ?(ЗначениеЗаполнено(Объект.ВалютаДокумента)
								,Истина
								,Ложь);
	
	ИзменениеОрганизацииСервер();
	
	Если Не ВалютаДокументаЗаполнена
		И ЗначениеЗаполнено(Объект.ВалютаДокумента) Тогда
		
		ДобавитьВКэш("ВалютаДокумента");
		ДобавитьВКэш("КратностьДокумента");
		ДобавитьВКэш("КурсДокумента");
		
	КонецЕсли;
	
КонецПроцедуры // ОрганизацияПриИзменении()

&НаКлиенте
Процедура ВалютаДокументаПриИзменении(Элемент)
	
	ИзменениеВалютыКлиент();
	
КонецПроцедуры // ВалютаДокументаПриИзменении()

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДанныеРаспределения

&НаКлиенте
Процедура ДанныеРаспределенияПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ЗаполнитьПризнакУчетаСчетаКлиент", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеРаспределенияКонтрагентПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДанныеРаспределения.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИзменениеКонтрагента(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеРаспределенияДоговорКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДанныеРаспределения.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НачалоВыбораДоговораКлиент(Элемент, ТекущиеДанные.ДоговорКонтрагента, ТекущиеДанные.Контрагент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеРаспределенияДоговорКонтрагентаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДанныеРаспределения.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИзменениеДоговораСервер(ТекущиеДанные.ДоговорКонтрагента, ТекущиеДанные.Контрагент);
	
	ЗаполнитьКурсВзаиморасчетов(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеРаспределенияСуммаАвансаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДанныеРаспределения.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьКурсАванса(ТекущиеДанные);
	
	РассчитатьСуммуПогашения(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеРаспределенияВалютнаяСуммаАвансаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДанныеРаспределения.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьКурсАванса(ТекущиеДанные);
	
	РассчитатьСуммуПогашения(ТекущиеДанные, "Валютная");
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеРаспределенияКурсАвансаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДанныеРаспределения.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.КурсАванса = 0 Тогда
		ТекущиеДанные.ВалютнаяСуммаАванса = 0;
	Иначе
		ТекущиеДанные.ВалютнаяСуммаАванса = ТекущиеДанные.СуммаАванса / ТекущиеДанные.КурсАванса;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеРаспределенияСуммаОбязательствПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДанныеРаспределения.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьСуммуПогашения(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеРаспределенияВалютнаяСуммаОбязательствПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДанныеРаспределения.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьСуммуПогашения(ТекущиеДанные, "Валютная");
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеРаспределенияСчетУчетаАвансовПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДанныеРаспределения.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПризнакУчетаСчета(ТекущиеДанные.ПолучитьИдентификатор(), "СчетУчетаАвансов", "Валютный");
	
	Если НЕ ТекущиеДанные.СчетУчетаАвансовВалютный Тогда
		ТекущиеДанные.ВалютнаяСуммаАванса = 0;
		
		РассчитатьКурсАванса(ТекущиеДанные);
		РассчитатьСуммуПогашения(ТекущиеДанные, "Валютная");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеРаспределенияСчетУчетаОбязательствПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДанныеРаспределения.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПризнакУчетаСчета(ТекущиеДанные.ПолучитьИдентификатор(), "СчетУчетаОбязательств", "Валютный");
	
	Если НЕ ТекущиеДанные.СчетУчетаОбязательствВалютный Тогда
		ТекущиеДанные.ВалютнаяСуммаОбязательств = 0;
		
		РассчитатьСуммуПогашения(ТекущиеДанные, "Валютная");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область СтандартныеПодсистемыОбработчикиКоманд

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(Знач ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	
	Если Объект.ДанныеРаспределения.Количество() > 0 Тогда
		
		Оповещение = Новый ОписаниеОповещения("КомандаЗаполнитьЗавершение", ЭтотОбъект);
		ТекстВопроса =  НСтр("ru = 'Данные по договорам будут очищены. Продолжить?'; 
		                     |en = 'Contract data will be cleared. Proceed?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ЗаполнитьДанныеРаспределения();
		
		Если Объект.ДанныеРаспределения.Количество() = 0 Тогда
			ТекстСообщения = НСтр("ru = 'Нет данных для зачета авансов.'; 
			                      |en = 'There is no data to set off advances.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

// Процедура-обработчик оповещения вопроса из процедуры Заполнить.
// 
&НаКлиенте
Процедура КомандаЗаполнитьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДанныеРаспределения();
	
	Если Объект.ДанныеРаспределения.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Нет данных для зачета авансов.'; 
		                      |en = 'There is no data to set off advances.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбщиеСлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	ЭлементУО1 = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО1.Поля, "ДанныеРаспределенияВалютнаяСуммаАванса");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО1.Отбор,
		"Объект.ДанныеРаспределения.СчетУчетаАвансовВалютный", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	
	ЭлементУО1.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	ЭлементУО2 = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО2.Поля, "ДанныеРаспределенияВалютнаяСуммаОбязательств");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО2.Отбор,
		"Объект.ДанныеРаспределения.СчетУчетаОбязательствВалютный", ВидСравненияКомпоновкиДанных.Равно, Ложь);
		
	ЭлементУО2.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = бит_ОбщегоНазначения.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	// Перечисления.
	КэшПеречисления = Новый Структура;
	// Адаптация для ERP. Начало. 18.03.2014{{
	КэшПеречисления.Вставить("ВидыДоговоровКонтрагентов", бит_ОбщегоНазначения.КэшироватьЗначенияПеречисления(Перечисления[бит_ОбщегоНазначения.ПолучитьИмяПеречисленияВидыДоговоровКонтрагентов()]));
	// Адаптация для ERP. Конец. 18.03.2014}}
	
	КэшированныеЗначения.Вставить("Перечисления", КэшПеречисления);
	
	// Запишем параметр для формирования заголовка.
	КэшированныеЗначения.Вставить("ПредставлениеОбъекта", Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	
	// Получим и запишем валюту МСФО в кэш значений.
	ПолучитьИЗаписатьВалютуМСФОВКэшЗначений(КэшированныеЗначения);
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

&НаСервере 
Процедура ПолучитьИЗаписатьВалютуМСФОВКэшЗначений(КэшированныеЗначения)
	
	// Получим валюту международного учета.
	ВалютаМСФО = бит_му_ОбщегоНазначения.ПолучитьВалютуМеждународногоУчета(Объект.Организация);
	
	КэшированныеЗначения.Вставить("ВалютаМСФО", ВалютаМСФО);
	
КонецПроцедуры // ПолучитьИЗаписатьВалютуМСФОВКэшЗначений()

&НаСервере
Процедура ИзменениеВалютыСервер()
	                 
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ИзменениеВалютыМодуль();
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	  
КонецПроцедуры // ИзменениеВалютыСервер()

&НаСервере
Процедура ИзменениеОрганизацииСервер()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	// Выполняем общие действия для всех документов при изменении Организации.
	бит_ОбщегоНазначения.ПриИзмененииЗначенияОрганизации(ДокументОбъект, Пользователи.ТекущийПользователь());
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
	// Получим и запишем валюту МСФО в кэш значений.
	ПолучитьИЗаписатьВалютуМСФОВКэшЗначений(КэшЗначений);
	
	Если Не ЗначениеЗаполнено(Объект.ВалютаДокумента) 
		И ЗначениеЗаполнено(КэшЗначений.ВалютаМСФО) Тогда
		
		Объект.ВалютаДокумента = КэшЗначений.ВалютаМСФО;
		
		ИзменениеВалютыСервер();
		
	КонецЕсли;
	
	// Заполним валюту МСФО.
	ЗаполнитьВалютуМСФО();	
	
	ОрганизацияОбъекта = Объект.Организация;
	ТаблицаОбъекта 	   = Объект.ДанныеРаспределения;
	
	// Проверим организацию договоров по табличной части.
	Для каждого СтрокаТаблицы Из ТаблицаОбъекта Цикл
		
		ТекущийДоговор = СтрокаТаблицы.ДоговорКонтрагента;
		
		Если ЗначениеЗаполнено(ТекущийДоговор) И ТекущийДоговор.Организация <> ОрганизацияОбъекта Тогда
			 
			ТекстНачало = НСтр("ru = 'В строке №%1 организация договора ""%2""'; 
			              |en = 'In line №%1 the organization of the agreement ""%2""'");
			ТекстКонец  = НСтр("ru = 'не соответствует организации документа. Договор очищен.'; 
			              |en = 'does not match the organization of the document. The contract is cleared.'"); 
			ТекстСообщения = ТекстНачало + " " + ТекстКонец;								
			ТекстСообщения = СтрШаблон(ТекстСообщения, Строка(СтрокаТаблицы.НомерСтроки), Строка(ТекущийДоговор));			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Объект, "Объект.ДанныеРаспределения");
			
			СтрокаТаблицы.ДоговорКонтрагента = Неопределено;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ИзменениеОрганизацииСервер()

&НаСервере
Процедура ИзменениеКонтрагента(Знач ИдСтроки)

	ТекущиеДанные = Объект.ДанныеРаспределения.НайтиПоИдентификатору(ИдСтроки);	
	Если ТекущиеДанные = Неопределено Тогда	
		Возврат;	
	КонецЕсли; 
	
	// Выполняем общие действия для всех документов при изменении Контрагента.
	бит_МеханизмыТиповых.УстановитьДоговорКонтрагента(ТекущиеДанные.ДоговорКонтрагента,
		ТекущиеДанные.Контрагент, Объект.Организация, СписокВидовДоговоров);
														  
	// Мог поменяться договор.
	ИзменениеДоговораСервер(ТекущиеДанные.ДоговорКонтрагента, ТекущиеДанные.Контрагент);
														  
	ЗаполнитьКурсВзаиморасчетов(ТекущиеДанные.ПолучитьИдентификатор());	

КонецПроцедуры

&НаСервере 
Процедура ИзменениеДоговораСервер(Договор, Контрагент_Владелец)
	
	Если Не ЗначениеЗаполнено(Договор) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = Договор.Организация;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Контрагент_Владелец) Тогда
		Контрагент_Владелец = бит_ОбщегоНазначения.ОпределитьКонтрагентаПоДоговору(Договор);
	КонецЕсли; 
	
КонецПроцедуры // ИзменениеДоговораСервер()

&НаСервере 
Процедура ЗаполнитьВалютуМСФО(ЗаполнитьВалютуДокумента=Истина)
	
	// Получим строковое представление валюты международного учета.
	СтрокаВалютаМСФО = Строка(КэшЗначений.ВалютаМСФО);
	
	Элементы.ВалютаМСФО.Заголовок = ?(ПустаяСтрока(СтрокаВалютаМСФО), "НЕ УСТАНОВЛЕНА", СтрокаВалютаМСФО);
	
	Если ЗаполнитьВалютуДокумента Тогда
		Объект.ВалютаДокумента = КэшЗначений.ВалютаМСФО;
		УстановитьКурсКратностьДокумента(Объект.ВалютаДокумента, Объект.Дата, Объект.КурсДокумента, Объект.КратностьДокумента);
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьВалютуМСФО()

&НаСервереБезКонтекста
Процедура УстановитьКурсКратностьДокумента(Валюта, Дата, Курс, Кратность)
    
    СтрКурса = бит_КурсыВалют.ПолучитьКурсВалюты(Валюта, Дата);
    
    Курс      = СтрКурса.Курс;
    Кратность = СтрКурса.Кратность;
    
КонецПроцедуры // ИзменениеВалюты()

&НаСервере         
Процедура ЗаполнитьКурсВзаиморасчетов(Идентификатор)

	ТекущиеДанные = Объект.ДанныеРаспределения.НайтиПоИдентификатору(Идентификатор);
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ВалютаВзаиморасчетов = ТекущиеДанные.ДоговорКонтрагента.ВалютаВзаиморасчетов;
		
	СтрКурса = бит_КурсыВалют.ПолучитьКурсВалюты(ТекущиеДанные.ВалютаВзаиморасчетов, Объект.Дата);
	
	ТекущиеДанные.КурсВзаиморасчетов 		= СтрКурса.Курс;
	ТекущиеДанные.КратностьВзаиморасчетов 	= СтрКурса.Кратность;

КонецПроцедуры // ЗаполнитьКурсВзаиморасчетов()

&НаСервере
Процедура ЗаполнитьДанныеРаспределения()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ЗаполнитьТчДанныеРеклассификации();
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
	Для каждого ТекСтр Из Объект.ДанныеРаспределения Цикл
		ЗаполнитьПризнакиУчетаСчетов(ТекСтр);	
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьДанныеРаспределения()

&НаСервере
Процедура ЗаполнитьПризнакУчетаСчета(ИДСтроки, ИмяКолонки, ИмяПризнака)
	
	Если ТипЗнч(ИДСтроки) = Тип("Число") Тогда
		ТекущиеДанные = Объект.ДанныеРаспределения.НайтиПоИдентификатору(ИДСтроки);
	Иначе
		ТекущиеДанные = ИДСтроки;
	КонецЕсли;
	
	ТекущиеДанные[ИмяКолонки+ИмяПризнака] = ТекущиеДанные[ИмяКолонки][ИмяПризнака];
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПризнакиУчетаСчетов(ИДСтроки)
	
	ЗаполнитьПризнакУчетаСчета(ИДСтроки, "СчетУчетаАвансов", "Валютный");
	ЗаполнитьПризнакУчетаСчета(ИДСтроки, "СчетУчетаОбязательств", "Валютный");
	
КонецПроцедуры
     
#КонецОбласти  

#Область РаботаСКэшемРеквизитовФормы

// Процедура заполняет кэш реквизитов формы данными объекта.
// 
// Параметры:
//  Нет.
// 
&НаКлиенте 
Процедура ЗаполнитьТекущиеЗначенияРеквизитовФормы()
	
	Для Каждого КлючИЗначение Из мКэшРеквизитовФормы Цикл
		мКэшРеквизитовФормы[КлючИЗначение.Ключ] = Объект[КлючИЗначение.Ключ];
	КонецЦикла; 
	
КонецПроцедуры // ЗаполнитьТекущиеЗначенияРеквизитовФормы()

// Процедура добавляет в кэш реквизитов текущее значение заданного реквизита.
// 
// Параметры:
// 	ИмяРеквизита - Строка.
// 
&НаКлиенте
Процедура ДобавитьВКэш(ИмяРеквизита)
	
	мКэшРеквизитовФормы[ИмяРеквизита] = Объект[ИмяРеквизита];	
	
КонецПроцедуры // ДобавитьВКэш()

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

// Процедура устанвливает параметры выбора для элементов формы. 
// 
// Параметры:
//  МассивЭлементов - Массив.
// 
&НаСервере
Процедура УстановитьПараметрыВыбораДляСчетов()

	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить(Элементы.ДанныеРаспределенияСчетУчетаАвансов);
	МассивЭлементов.Добавить(Элементы.ДанныеРаспределенияСчетУчетаОбязательств);
	
	бит_РаботаСДиалогамиСервер.УстановитьПараметрыВыбораДляЭлементов(МассивЭлементов);
	
КонецПроцедуры // УстановитьПараметрыВыбораДляСчетов() 

// Процедура устанавливает отборы для договора контрагента.
// 
// Параметры:
//  Элемент    			- ПолеФормы. Для которого необходимо установить параметры выбора.
//  Контрагент_Владелец - СправочникСсылка.Контрагенты.
// 
&НаКлиенте
Процедура УстановитьПараметрыВыбораДоговораКонтрагента(Элемент, Контрагент_Владелец)

	СтруктураОтбора = Новый Структура;
	
	Если ЗначениеЗаполнено(Контрагент_Владелец) Тогда
		СтруктураОтбора.Вставить(РеквизитКонтрагента, Контрагент_Владелец);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		СтруктураОтбора.Вставить("Организация", Объект.Организация);
	КонецЕсли;
	
	Если НЕ бит_ОбщегоНазначенияКлиентСерверПереопределяемый.ЭтоСемействоERP() Тогда
		Если СписокВидовДоговоров.Количество() > 0 Тогда
			СтруктураОтбора.Вставить("ВидДоговора", СписокВидовДоговоров);
		КонецЕсли;
	КонецЕсли;

	// Установим параметры выбора.
	бит_ОбщегоНазначенияКлиентСервер.УстановитьПараметрыВыбораЭлемента(Элемент, СтруктураОтбора);

	
КонецПроцедуры // УстановитьПараметрыВыбораДоговораКонтрагента()

// Процедура формирует список доступных видов договоров.
// 
// Параметры:
//  Нет.
// 
&НаКлиенте 
Процедура ОпределитьСписокДоступныхВидовДоговоров()
	
	СписокВидовДоговоров.Очистить();
	
КонецПроцедуры // ОпределитьСписокДоступныхВидовДоговоровПоОперации()

// Процедура обрабатывает изменение валюты документа. Клиент.
// 
// Параметры:
//  Нет.
// 
&НаКлиенте
Процедура ИзменениеВалютыКлиент() 
	
	ИзменениеВалютыСервер();
	
	ДобавитьВКэш("ВалютаДокумента");
	ДобавитьВКэш("КратностьДокумента");
	ДобавитьВКэш("КурсДокумента");
	
КонецПроцедуры // ИзменениеВалютыКлиент()

// Процедура выполняет действия необходимые при начале выбора Договора. Клиент.
// 
// Параметры:
//  Элемент    			 - ПолеФормы. Для которого необходимо установить параметры выбора.
//  Договор				 - СправочникСсылка.ДоговорыКонтрагентов.
//  Контрагент_Владелец  - СправочникСсылка.Контрагенты.
//  СтандартнаяОбработка - Булево.
// 
&НаКлиенте 
Процедура НачалоВыбораДоговораКлиент(Элемент, Договор, Контрагент_Владелец, СтандартнаяОбработка)
	
	УстановитьПараметрыВыбораДоговораКонтрагента(Элемент, Контрагент_Владелец);
		
КонецПроцедуры // НачалоВыбораДоговораКлиент()

&НаКлиенте
Процедура РассчитатьКурсАванса(ТекущиеДанные)
	
	Если ТекущиеДанные.ВалютнаяСуммаАванса = 0 Тогда
		ТекущиеДанные.КурсАванса = 1;
	Иначе
		ТекущиеДанные.КурсАванса = ТекущиеДанные.СуммаАванса / ТекущиеДанные.ВалютнаяСуммаАванса;
	КонецЕсли;
	
КонецПроцедуры

// Процедура рассчитывает сумму погашения для переданной строки.
// 
// Параметры:
// 	ТекущиеДанные - СтрокаТабличнойЧасти
// 	ВидСуммы - строка - пустая строка или "Валютная".
// 
&НаКлиенте
Процедура РассчитатьСуммуПогашения(ТекущиеДанные, ВидСуммы="")
	
	ТекущиеДанные[ВидСуммы+"СуммаПогашения"] = Мин(ТекущиеДанные[ВидСуммы+"СуммаАванса"], ТекущиеДанные[ВидСуммы+"СуммаОбязательств"]);
	
КонецПроцедуры

// Процедура - обработчик ожидания при активизации строки, используется для
// 	заполнения признаков учета счетов. Эти признаки влияют на доступность соответствующих колонок с валютными суммами.
//
&НаКлиенте
Процедура ЗаполнитьПризнакУчетаСчетаКлиент()
	
	ТекущиеДанные = Элементы.ДанныеРаспределения.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПризнакиУчетаСчетов(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииДляУправленияВнешнимВидомФормы

// Процедура осуществляет управление доступностью/видимостью элементов формы.
// 
// Параметры:
//  Нет.
// 
&НаСервере 
Процедура УправлениеЭлементамиФормы()
	
	Элементы.ОтразитьВЗакрытомПериоде.Видимость = бит_ПраваДоступа.ПолучитьЗначениеДопПраваПользователя(
		Пользователи.ТекущийПользователь(), ПланыВидовХарактеристик.бит_ДополнительныеПраваПользователей.РазрешеноОтражениеДокументовВЗакрытомПериоде);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
